# 겨울방학 파이썬 스터디 4차시 과제

## A.

**A1.** 출력값이 아래와 동일하도록 DataFrame을 생성하시오. (1점)

|  | continent	| year	| lifeExp	| pop	| gdpPercap |
| ----- | ------------- | ------ | -------- | ----------- | --------- |
| 0 |	Asia|	1952|	28|	843|	779.4 |
| 1 |	Asia|	1957|	30|	924	|820.7 |
| 2 |	Asia|	1962|	31|	1083|	853.1 |
| 3 |	Asia|	1967|	34|	1376|	836.1 |
| 4 |	Asia|	1972|	36|	1370|	739.9 |
| 5 |	Asia| 1977|	38|	1488|	786.3 |

In [1]:
#code here

**A2.** 인덱싱을 이용하여 데이터프레임에서 1376를 출력하시오. (1점)

In [34]:
#code here

1376

**A3.** 두 가지 방법으로 DataFrame의 열 순서를 지금과 반대로 변경하시오. (구글링)  (2점)

In [52]:
#code here

   gdpPercap   pop  lifeExp  year continent
0      779.4   843       28  1952      Asia
1      820.7   924       30  1957      Asia
2      853.1  1083       31  1962      Asia
3      836.1  1376       34  1967      Asia
4      739.9  1370       36  1972      Asia
5      786.3  1488       38  1977      Asia

In [53]:
#code here

   gdpPercap   pop  lifeExp  year continent
0      779.4   843       28  1952      Asia
1      820.7   924       30  1957      Asia
2      853.1  1083       31  1962      Asia
3      836.1  1376       34  1967      Asia
4      739.9  1370       36  1972      Asia
5      786.3  1488       38  1977      Asia

## B.

**B1.** dataCustomers, dataTransactions 데이터를 합쳐서 df를 만들고 column의 이름을 한글로 바꾸시오. 단, 구분자는 tab이다. (1점)

In [35]:
import pandas as pd

In [36]:
#code here

In [37]:
#code here

In [38]:
#code here

,고객 아이디,성별,나이,결혼여부,거주지,직업,구매일자,상점,상품번호,브랜드,코너,수입,구매액,할부
0,10070,여,28,미혼,Yongsan-gu,제조업,2000-06-27 12:23,무역점,4408173027000,1492마일즈,유니캐주얼,0,39000,1
1,10070,여,28,미혼,Yongsan-gu,제조업,2000-09-03 11:33,신촌점,4106530008200,메이컵포에버,화장품,1,18000,1
2,10070,여,28,미혼,Yongsan-gu,제조업,2000-10-05 12:10,무역점,4800429513002,밀라노스토리무역,캐릭터캐주얼,0,39000,1
3,10070,여,28,미혼,Yongsan-gu,제조업,2000-10-05 18:43,무역점,4408173027000,1492마일즈,유니캐주얼,0,69000,1
4,10070,여,28,미혼,Yongsan-gu,제조업,2000-10-17 19:10,무역점,4800429513002,밀라노스토리무역,캐릭터캐주얼,0,74000,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19120,49470,남,69,기혼,Yongsan-gu,제조업,2001-04-12 11:50,본점,4125900006670,쟝폴클라리쎄,장신구,0,30000,1
19121,49470,남,69,기혼,Yongsan-gu,제조업,2001-04-12 12:30,본점,2700000000000,식품,일반식품,0,118431,1
19122,49470,남,69,기혼,Yongsan-gu,제조업,2001-04-13 17:10,본점,4107320001120,월비스타킹,섬유,0,20400,1
19123,49470,남,69,기혼,Yongsan-gu,제조업,2001-04-13 17:10,본점,4125900006620,쟝폴클라리쎄,장신구,0,48000,1
19124,49470,남,69,기혼,Yongsan-gu,제조업,2001-04-13 17:40,본점,2700000000000,식품,일반식품,0,61172,1

**B2.** brand의 종류의 수를 구하시오. (1점)

In [39]:
#code here

1191

**B3.** 본점에서 화장품을 구입한 고객의 평균 나이를 구하시오. (2가지로 풀이할 것) (1점)

In [40]:
#code here

41.70152091254753

In [41]:
#code here

41.70152091254753

**B4.** 총 구매액이 가장 많은 사람부터 적은 사람 순으로 정렬하여 상위 10명만 출력하시오. (1점)

In [42]:
#code here

2226     15968
9331     30648
8228     28045
1290     13493
8538     28715
15224    40822
12706    35904
7958     27436
12800    36087
7640     27074
Name: 고객 아이디, dtype: int64

**B5.** 3월에 구매한 50대 여성의 평균 구매액을 구하시오. (2점)

In [43]:
#code here

133265.56069364163

**B6.** 지오다노는 어느 시간대에 가장 많이 팔리는지 구하시오. (2점)

In [44]:
#code here

'19'

**B7.** df에서 거주지의 비율을 구하고 df에 '거주지 비율'열을 추가하시오. (2점)

In [45]:
#code here

,고객 아이디,성별,나이,결혼여부,거주지,직업,구매일자,상점,상품번호,브랜드,코너,수입,구매액,할부,구매월,구매시간,거주지 비율
0,10070,여,28,미혼,Yongsan-gu,제조업,2000-06-27 12:23,무역점,4408173027000,1492마일즈,유니캐주얼,0,39000,1,06,12,3.236601
1,10070,여,28,미혼,Yongsan-gu,제조업,2000-09-03 11:33,신촌점,4106530008200,메이컵포에버,화장품,1,18000,1,09,11,3.236601
2,10070,여,28,미혼,Yongsan-gu,제조업,2000-10-05 12:10,무역점,4800429513002,밀라노스토리무역,캐릭터캐주얼,0,39000,1,10,12,3.236601
3,10070,여,28,미혼,Yongsan-gu,제조업,2000-10-05 18:43,무역점,4408173027000,1492마일즈,유니캐주얼,0,69000,1,10,18,3.236601
4,10070,여,28,미혼,Yongsan-gu,제조업,2000-10-17 19:10,무역점,4800429513002,밀라노스토리무역,캐릭터캐주얼,0,74000,1,10,19,3.236601

## C.

In [46]:
### 코드를 건드리지 마시고 실행해주세요.
info_login = pd.read_csv('info_login.csv',encoding='cp949').iloc[:148999,1:] ; info_login

C:\Users\gimje\Anaconda\lib\site-packages\IPython\core\interactiveshell.py:3063: DtypeWarning: Columns (4,5) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

        login_id  user_id            c_time   platform                 browser
0        14196.0  19195.0   2018-09-23 1:30  Windows 8  Internet Explorer 10.0
1        14234.0  22045.0   2018-09-23 2:46    Windows     Chrome 67.0.3396.99
2        14256.0   8790.0   2018-09-23 3:35    Windows    Chrome 69.0.3497.100
3        14278.0      NaN  2018-09-23 12:50    Windows    Chrome 69.0.3497.100
4        14279.0      NaN  2018-09-23 12:50    Windows    Chrome 69.0.3497.100
...          ...      ...               ...        ...                     ...
148994  584404.0  19696.0  2020-12-08 23:46        NaN                     NaN
148995  584405.0   6586.0  2020-12-08 23:49        NaN                     NaN
148996  584406.0  19303.0  2020-12-08 23:49        NaN                     NaN
148997  584407.0  11103.0  2020-12-08 23:51        NaN                     NaN
148998  584408.0   6600.0  2020-12-08 23:59        NaN                     NaN

[148999 rows x 5 columns]

**C1.** 위에 데이터를 가지고 user_id가 NaN인 행은 모두 지우고, platform과 browser는 최빈값으로 대체하시오.\
(결측치를 채운 후에 인덱스 번호를 다시 생성하시오)  (2점)

In [47]:
#code here

**C2.** 위에 만든 info_login데이터를 가지고 login_id와 user_id를 int형으로 바꾸세요. (info_login을 출력할때 바뀐 형태로 출력되어야 함)  (1점)

In [50]:
#code here

        login_id  user_id            c_time   platform                 browser
0          14196    19195   2018-09-23 1:30  Windows 8  Internet Explorer 10.0
1          14234    22045   2018-09-23 2:46    Windows     Chrome 67.0.3396.99
2          14256     8790   2018-09-23 3:35    Windows    Chrome 69.0.3497.100
3          14280    10206  2018-09-23 13:24    Windows    Chrome 68.0.3440.106
4          14288      488  2018-09-23 14:05  Windows 7    Chrome 68.0.3440.106
...          ...      ...               ...        ...                     ...
141580    584404    19696  2020-12-08 23:46    Windows    Chrome 78.0.3904.108
141581    584405     6586  2020-12-08 23:49    Windows    Chrome 78.0.3904.108
141582    584406    19303  2020-12-08 23:49    Windows    Chrome 78.0.3904.108
141583    584407    11103  2020-12-08 23:51    Windows    Chrome 78.0.3904.108
141584    584408     6600  2020-12-08 23:59    Windows    Chrome 78.0.3904.108

[141585 rows x 5 columns]